backend/controllers/CategoryController.php

    public function actionView($id)
    {
        $searchModel = new CategorySearch();
      //  $data = $searchModel->findcate();
        $getArticles = Category::findOne(Yii::$app->request->get('id'));
        return $this->render('view', [
            'model' => $this->findModel($id),
            'article' =>$getArticles->articles,
          //  'data'=> $data
        ]);
---
SELECT * FROM `category` WHERE `id`='9'
SELECT * FROM `article` WHERE `category_id`=9

    public function actionCreate()
    {
        $request = Yii::$app->request;
        $model = new Category();
        $model->created_at = time();
        $model->updated_at = time();
        $model->parentid = $request->get('id')?$request->get('id'):0;

        if ($model->load($request->post()) && $model->save()) {
---
INSERT INTO `category` (`created_at`, `updated_at`, `parentid`, `cname`) VALUES (1426768899, 1426768899, 0, 'g')

    protected function findModel($id)
    {
        if (($model = Category::findOne($id)) !== null) {
---
SELECT * FROM `category` WHERE `id`='9'