backend/controllers/ColumnController.php

SELECT * FROM `columns` WHERE `id`='1'
SELECT * FROM `article` WHERE `column_id`=11
---
    public function actionView($id)
    {

        $getArticles = Column::findOne(Yii::$app->request->get('id'));
        return $this->render('view', [
            'model' => $this->findModel($id),
            'article' =>$getArticles->articles,

        ]);

INSERT INTO `column` (`created_at`, `updated_at`, `parentid`, `cname`, `model_id`, `isArticle`, `isShow`, `sort`, `content`) VALUES (1427036959, 1427036959, 0, '223', 2, 2, 2, 7, '<p>而</p>')
---
    public function actionCreate()
    {
        $request = Yii::$app->request;
        $model = new Column();
        $model->created_at = time();
        $model->updated_at = time();
        $model->parentid = $request->get('id')?$request->get('id'):0;

        if ($model->load($request->post()) && $model->save()) {

SELECT * FROM `columns` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Column::findOne($id)) !== null) {