backend/controllers/TemplateController.php

    protected function findModel($id)
    {
        if (($model = Template::findOne($id)) !== null) {
---
SELECT * FROM `template` WHERE `id`='1'