// JavaScript Document

$(function(){
    /*
     *	-------------------------------------------------------------------------------------
     *	| key           | description                                   | default           |
     *	|---------------|-----------------------------------------------|-------------------|
     *	| speed         | 滚动的间隔毫秒数，数值越小，滚动越快。						| 500				|
     *	|---------------|-----------------------------------------------|-------------------|
     *	| offset        | 距离滚动顶部的点数（pixels）。						    | 0   				|
     *	|---------------|-----------------------------------------------|-------------------|
     *	| relativeTo    | 设置滚动的DIV靠上还是靠下，可以设置为"top"或"bottom"			| top				|
     *	|---------------|-----------------------------------------------|-------------------|
     *	| killSwitch    | 开启和取消跟随滚动开关的元素ID，需要jQuery Cookie 插件支持		| "killSwitch"		|
     *	|---------------|-----------------------------------------------|-------------------|
     *	| onText        | 如果启用了跟随滚动，开关显示的文字。 							| "Turn Slide Off"	|
     *	|---------------|-----------------------------------------------|-------------------|
     *	| offText       | 如果取消了跟随滚动，开关显示的文字。							| "Turn Slide On"	|
     *	|---------------|-----------------------------------------------|-------------------|
     *	| delay         | 控制滚动延时										| 0					|
     *	|---------------|-----------------------------------------------|-------------------|
     *	| container     | 滚动范围设置DIV的ID									| 框的直接父对象			|
     *	-------------------------------------------------------------------------------------
     */
    $("#newkefu_right").scrollFollow({
        speed:500,/* 移动速度 */

        offset: 100
    });
    $("#newkefu_bar").hover(
        function()/* 鼠标移入 */{
            $("#group_pad").show("slow");
            $("#newkefu_bar").attr("src","/images/qq/kefu-left.png");
        },
        function()/* 鼠标移出 */{
            $("#newkefu_right").hover(
                function()/* 鼠标移入 */{
                    $("#group_pad").show("slow");
                    $("#newkefu_bar").attr("src","/images/qq/kefu-left.png");
                },
                function()/* 鼠标移出 */{
                    $("#group_pad").hide("slow");
                    $("#newkefu_bar").attr("src","/images/qq/kefu-right.png");
                }
            );
        }
    );
});