backend/models/templateSearch.php

SELECT * FROM `template`
---
    public function templateList()
    {
        $data = Template::find()->asArray()->all();